# FailureDefinitionRegistry Properties

---
The FailureDefinitionRegistry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace